Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memr.tmx
Source language: ca
Languages: es

source: Totes les aproximacions a la traducció automàtica descrites fins ara són de naturalesa deductiva, és a dir, estan programades a partir de teories i dades lingüístiques sobre la traducció.
es: Todas las aproximaciones a la traducción automática descritas hasta ahora son de naturaleza deductiva, es decir, están programadas a partir de teorías y datos lingüísticos sobre la traducción.

source: Traducció directa?
es: ¿Traducción directa?

source: Traducció directa i traducció indirecta
es: Traducción directa y traducción indirecta

source: Traducció indirecta per transferència
es: Traducción indirecta por transferencia

source: Traduir una oració, en aquest esquema, comporta: fer-ne l'anàlisi sintàctica completa assignar interpretació a cada mot construir composicionalment una interpretació de l'oració analitzar-la per a obtenir mots i un arbre d'anàlisi sintàctica per a la llengua meta i generar una oració en llengua meta a partir dels mots i l'arbre.
es: Traducir una oración, en este esquema, conlleva: hacer el análisis sintáctico completo asignar interpretación a cada palabra construir composicionalmente una interpretación de la oración analizarla para obtener palabras y un árbol de análisis sintáctico para la lengua meta y generar una oración en lengua meta a partir de las palabras y el árbol.

source: Trieu dues llengües $A$ i $B$ i indiqueu quins canvis són previsibles, classificant-los segons la naturalesa lingüística dels fenomens que han causat els canvis, explicant la raó del resultat si cal amb un exemple.
es: Elegid dos lenguas $A$ y $B$ e indicad qué cambios son previsibles, clasificándolos según la naturaleza lingüística de los fenómenos que han causado los cambios, explicando la razón del resultado si es necesario con un ejemplo.

source: Tècniques de traducció automàtica
es: Técnicas de traducción automática

source: Típicament, el mot més freqüent pot arribar a constituir el 10% de tot el text, però el segon només cobreix al voltant del 5%, el tercer al voltant del 3%, etc.; quan arribem al 100é mot més freqüent ja hem de parlar del 0,1% (una vegada cada 1.000 mots), i si arribem a la posició 1000, del 0,01% (una vegada cada 10.000 mots).
es: Típicamente, la palabra más frecuente puede llegar a constituir el 10% de todo el texto, pero el segundo sólo cubre alrededor del 5%, el tercero alrededor del 3%, etc.; cuando llegamos la palabra 100 más frecuente ya tenemos que hablar del 0,1% (una vez cada 1.000 palabras), y si llegamos a la posición 1000, del 0,01% (una vez cada 10.000 palabras).

source: Un graf dirigit té dues parts: un conjunt de nodes, nusos o vèrtexs (representats gràficament com a punts o cercles) i un conjunt de fletxes cada una de les quals va d'un vèrtex a altre.
es: Un grafo dirigido tiene dos partes: un conjunto de nodos, nudos o vértices (representados gráficamente como puntos o círculos) y un conjunto de flechas cada una de las cuales va de un vértice a otro.

source: Un sistema de transferència és el que fa les traduccions en tres fases ben diferenciades anomenades anàlisi, transferència i generació: La fase d'anàlisi produeix, a partir de la frase en la LO, una representació abstracta (RALO).
es: Un sistema de transferencia es el que hace las traducciones en tres fases bien definidas denominadas análisis, transferencia y generación: La fase deanálisis produce, a partir de la frase en la LO, una representación abstracta (RALO).

source: Un altre exemple clàssic el constitueixen les tres maneres diferents en què es pot expressar que a algú li produeix plaer fer una acció: la primera, la catalana m'agrada nadar o l'espanyola me gusta nadar, on l'acció de nadar és el subjecte i el receptor de plaer l'objecte indirecte; la segona, la de l'anglés I like swimming o el francés j'aime nager, on el receptor de plaer és subjecte i l'acció de nadar l'objecte; la tercera, la neerlandesa ik swemme graag o l'alemanya ich schwimme gern on l'acció de nadar passa a ser el verb principal i l'acció d'agradar es converteix en un adverbi.
es: Otro ejemplo clásico lo constituyen las tres maneras diferentes en que se puede expresar que a alguien le produce placer hacer una acción: la primera, la catalana m'agrada nadar o la española me gusta nadar, donde la acción de nadar es el sujeto y el receptor de placer el objeto indirecto; la segunda, la del inglés I like swimming</I12> o el francés <I13>j''aime nager<\/y13>, donde el receptor de placer es sujeto y la acción de nadar el objeto; la tercera, la neerlandesa ik swemme graag o la alemana ich schwimme gern<\/y15> donde la acción de nadar pasa a ser el verbo principal y la acción de gustar se convierte en un adverbio.

source: Un amic meu ha dissenyat un sistema de traducció automàtica entre l'espanyol i el portugués, però tot i que m'assegura que no ha programat cap tractament de l'ambigüitat estructural, el seu sistema tradueix perfectament un munt d'oracions amb aquest tipus de ambigüitat.
es: Un amigo mío ha diseñado un sistema de traducción automática entre el español y el portugués, pero a pesar de que me asegura que no ha programado ningún tratamiento de la ambigüedad estructural, su sistema traduce perfectamente un montón de oraciones con este tipo de ambigüedad.

source: Un analitzador morfològic, per tant, ha de tenir la informació següent sobre la llengua dels textos que s'han d'analitzar: el vocabulari o conjunt de lemes, els paradigmes de flexió, i la correspondència entre lemes i paradigmes.
es: Un analizador morfológico, por lo tanto, tiene que tener la información siguiente sobre la lengua de los textos que se tienen que analizar: el vocabulario o conjunto de lemas, los paradigmas de flexión, y la correspondencia entre lemas y paradigmas.

source: Un dels avantatges més importants de tots sistemes d'interlingua respecte dels sistemes de transferència és la facilitat amb què es pot afegir una llengua nova a un sistema de traducció automàtica multilingüe.
es: Uno de las ventajas más importantes de todos sistemas de interlingua respecto de los sistemas de transferencia es la facilidad con que se puede añadir una lengua nueva a un sistema de traducción automática multilingüe.

source: Un estudi de bigrames (parelles) com aquests pot servir:
es: Un estudio de bigramas (parejas) como estos puede servir:

source: Un exemple clàssic d'això el donen les oracions adjectives de relatiu; la sèrie de sintagmes nominals ``el cotxe'', ``el cotxe que va dur l'home'', ``el cotxe que va dur l'home que va vindre del poble'', ``el cotxe que va dur l'home que va vindre del poble que vam visitar durant el viatge'', etc., demostra que no hi ha límits a la longitud d'un sintagma (nominal, en aquest cas).
es: Un ejemplo clásico de esto lo dan las oraciones adjetivas de relativo; la serie de sintagmas nominales ``el coche'', ``el coche que trajo el hombre'', ``el coche que trajo el hombre que vino del pueblo'', ``el coche que trajo el hombre que vino del pueblo que visitamos durante el viaje'', etc., demuestra que no hay límites en la longitud de un sintagma (nominal, en este caso).

source: Un exemple servirà per a il·lustrar tots aquests conceptes. Imaginem la següent gramàtica simplificada que accepta un bon nombre d'oracions simples en català: $$ {rcl} {O} {SN} {SV}
es: Un ejemplo servirá para ilustrar todos estos conceptos. Imaginemos la siguiente gramática simplificada que acepta un buen número de oraciones simples en catalán: $$ {rcl} {O} {SN} {SV}

source: Un sistema complet de transferència que traduïra entre aquestes tres llengües en els dos sentits tindria tres mòduls d'anàlisi (que anomenarem $A_1$, $A_2$ i $A_3$), tres mòduls de generació (que anomenarem $G_1$, $G_2$ i $G_3$) i sis mòduls de transferència (que anomenarem $T_{12}$, $T_{13}$, $T_{23}$, $T_{31}$, $T_{32}$ i $T_{21}$). Afegir un quart idioma $L_4$ al sistema comporta: Crear un nou mòdul d'anàlisi ($A_4$).
es: Un sistema completo de transferencia que tradujera entre estas tres lenguas en los dos sentidos tendría tres módulos de análisis (que denominaremos $A_1$, $A_2$ y $A_3$), tres módulos de generación (que denominaremos $G_1$, $G_2$ y $G_3$) y seis módulos de transferencia (que denominaremos $T_{12}$, $T_{13}$, $T_{23}$, $T_{31}$, $T_{32}$ y $T_{21}$). Añadir un cuarto idioma $L_4$ al sistema comporta: Crear un nuevo módulo de análisis ($A_4$).

source: Un sistema real de transferència sintàctica hauria de considerar aquests casos de manera especial.
es: Un sistema real de transferencia sintáctica tendría que considerar estos casos de manera especial.

source: Un transductor de lletres es pot definir formalment com $T=(Q,L,,q_I,F)$, on $Q$ és un conjunt finit d'estats, $L$ un conjunt d'etiquetes de transició, $q_I Q$ és l'{ estat inicial}, $F Q$ el conjunt d'estats finals i $: Q L 2^Q$ és la funció de transició (on $2^Q$ representa el conjunt de tots els subconjunts de $Q$).
es: Un transductor de letras se puede definir formalmente como $T=(Q,L,,q_I,F)$, donde $Q$ es un conjunto finito deestados, $L$ un conjunto deetiquetas de transición, $q_I Q$ es el{ estado inicial}, $F Q$ el conjunto deestados finales y $: Q L 2^Q$ es la función de transición (donde $2^Q$ representa el conjunto de todos los subconjuntos de $Q$).

source: Una aproximació a la traducció humana assistida per ordinador (és a dir, semiautomàtica) que està molt relacionada amb la traducció directa és la que s'usa en les anomenades memòries de traducció (vegeu el capítol ).
es: Una aproximación a la traducción humana asistida por ordenador (es decir, semiautomática) que está muy relacionada con la traducción directa es la que se usa en las denominadas memorias de traducción (mirad el capítulo ).

source: Una característica important d'interlingua és que els determinants (un, le, alcun, iste, mi, tu, etc.) i els adjectius són invariables.
es: Una característica importante de interlingua es que los determinantes (un, le, alcun, iste, mi, tu, etc.) y los adjetivos son invariables.

source: Una manera d'identificar zones on s'ha d'establir la concordança és detectar seqüències de mots, de manera similar a com es fa en els sistemes de transferència morfològica, però sense reordenar-les.
es: Una manera de identificar zonas donde se tiene que establecer la concordancia es detectar secuencias de palabras, de manera similar a cómo se hace en los sistemas de transferencia morfológica, pero sin reordenarlas.

source: Una possible solució usa frases preposicionals del tipus de del qual postposades a la traducció del sintagma nominal que segueix a cuyo.
es: Una posible solución usa frases preposicionales del tipo de del qual pospuestas a la traducción del sintagma nominal que sigue a cuyo.

source: Una tècnica observada en alguns programes és la següent: (a) els reordenaments es van aplicant segons es recorre la frase d'esquerra a dreta; (b) els reordenaments de seqüències més llargues tenen prioritat, i (c) els mots afectats per un reordenament no tornen a estar involucrats en cap altre reordenament.
es: Una técnica observada en algunos programas es la siguiente: (a) los reordenamientos se aplicaron según se recorre la frase de izquierda a derecha; (b) los reordenamientos de secuencias más largas tienen prioridad, y (c) las palabras afectadas por un reordenamiento no vuelven a estar involucradas en ningún otro reordenamiento.

source: Usant un algorisme estàndard que no ve al cas detallar ací, la gramàtica es transforma en la taula d'anàlisi sintàctica corresponent (taula ), que indica què cal fer en cada pas de l'anàlisi.
es: Usando un algoritmo estándar que no viene a cuento detallar aquí, la gramática se transforma en la tabla de análisis sintáctico correspondiente (tabla ), que indica qué hay que hacer en cada paso del análisis.

source: Vegem com es faria l'anàlisi de l'oració (no ambigua) L'home porta la clau.
es: Veamos como se haría el análisis de la oración (no ambigua) El hombre trae la llave.

source: Vegem que passa amb cada una de les oracions: { Nos ofreció un postre} $$ { Ens va oferir unes postres}: La traducció és correcta.
es: Veamos qué pasa con cada una de las oraciones: { Nos ofreció un postre} $$ { Nos ofreció unos postres}: La traducción es correcta.

source: Veurem més endavant de quina naturalesa són aquestes representacions intermèdies.
es: Más adelante veremos de qué naturaleza son estas representaciones intermedias.

source: [0.2cm] {{9cm}{ DICCIONARI BILINGÜE:
es: [0.2cm] {{9cm}{ DICCIONARIO BILINGÜE:

source: [0.2cm] {{8cm}{ $artadjnartnadj$
es: $R_2$: verbo arte nombre adj $$ arte nombre adj verbo

source: [Aproximacions inductives a la TA]{Aproximacions inductives a la traducció automàtica}
es: [Aproximaciones inductivas a la TA]{Aproximaciones inductivas a la traducción automática}

source: [La traducció automàtica real entre]{La traducció automàtica real entre el principi de composicionalitat semàntica i la traducció mot per mot}
es: [La traducción automática real entre]{La traducción automática real entre el principio de composicionalidad semántica y la traducción palabra por palabra}

source: [Sistemes sense transferència: interlingua]{Sistemes sense transferència: els sistemes d'{ interlingua}}
es: [Sistemas sin transferencia: interlingua]{Sistemas sin transferencia: los sistemas de{ interlingua}}

source: [_{SN} la comunitat ] [_{SN} les senyes d'identitat bàsiques [_{SP} de la qual ] ] ] ] $$ El sintagma nominal que segueix a cuyo (i hi concorda en gènere i nombre) pot ser, en principi, indefinidament llarg; cal identificar-lo correctament, moure'l com una unitat i afegir-li la frase relativa { del qual} de manera que concorde ara (en gènere i nombre) amb l'antecedent (el sintagma nominal anterior al cuyo).
es: [_{SN} la comunitat ] [_{SN} les senyes d'identitat bàsiques [_{SP} de la qual ] ] ] ] $$ El sintagma nominal que sigue a cuyo (y concuerda en género y número) puede ser, en principio, indefinidamente largo; es necesario identificarlo correctamente, moverlo como una unidad y añadirle la frase relativa { del qual} de manera que concuerde ahora (en género y número) con el antecedente (el sintagma nominal anterior al cuyo).

source: [h!] {Detall de l'analitzador morfològic.
es: [h!] {Detalle del analizador morfológico.

source: `AGENT=JO' ) ) `DESTINATARI=JO' `TEMPS=PRESENT' )
es: `AGENTE=YO' ) ) `DESTINATARIO=YO' `TIEMPO=PRESENTE' )

source: `de' ) `SN$_2$' ) ) L'aplicació de la regla $R_2$ al ${SN}$ en l'arrel de l'arbre d'anàlisi sintàctica de la frase dóna com a resultat l'arbre que es veu en la figura .
es: `de' ) `SN$_2$' ) ) La aplicación de la regla $R_2$ al ${SN}$ en la raíz del árbol de análisis sintáctico de la frase da como resultado el árbol que se ve en la figura .

source: `SN$_2$' `A' ) i una altra per a reordenar els sintagmes nominals que contenen un genitiu saxó: $R_2:$ (.SN$_1$.
es: `SN$_2$' `A' ) y otra para reordenar los sintagmas nominales que contienen un genitivo sajón: $R_2:$ (.SN$_1$.

source: `car' ) ) ) ) {Arbre d'anàlisi sintàctica del sintagma nominal ``The old professor's smart girlfriend's red car''} Un sistema de transferència sintàctica de l'anglés al català podria usar dues regles per a transformar subarbres (parts de l'arbre), una per a moure els adjectius: $R_1:$ (.{SN}$_1$.
es: `car' ) ) ) ) {Árbol de análisis sintáctico del sintagma nominal ``The old professor's smart girlfriend's red car''} Un sistema de transferencia sintáctica del inglés al catalán podría usar dos reglas para transformar subárboles (partes del árbol), una para mover los adjetivos: $R_1:$ (.{SN}$_1$.

source: `girlfriend' ) ) ) ) ) ) {Arbre d'anàlisi sintàctica del sintagma ``The old professor's smart girlfriend's red car'' després d'aplicar-hi la regla $R_2$ al $SN$ principal o arrel (vegeu el text i la figura ).} Després caldria aplicar la regla $R_1$ al ${SN}$ que genera ``red car'', després la regla $R_2$ al $SN$ que genera ``old professor's smart girlfriend'', etc.
es: `girlfriend' ) ) ) ) ) ) {Árbol de análisis sintáctico del sintagma ``The old professor's smart girlfriend's red car'' después de aplicarle la regla $R_2$ al $SN$ principal o raíz (mirad el texto y la figura ).} Después sería necesario aplicar la regla $R_1$ al ${SN}$ que genera ``red car'', después la regla $R_2$ al $SN$ que genera ``old professor's smart girlfriend'', etc.

source: acceptar
es: aceptar

source: anàlisi finalitzada
es: análisis finalizado

source: detectar ``determinant nom''; propagar el nombre (sing./pl.) del determinant maori (te/ng{a}) al nom català; propagar el gènere (masc./fem.) del nom català al determinant català.
es: detectar ``determinante nombre''; propagar el número (sing./pl.) del determinando maori (te/ng{a )}al nombre catalán; propagar el género (masc./estiércol.) del nombre catalán al determinante catalán.

source: no calen experts bilingües per a construir mòduls de transferència (és poc versemblant que existisquen experts asturià-català o asturià-sard).
es: no hacen falta expertos bilingües para construir módulos de transferencia (es poco verosímil que existan expertos asturiano-catalán o asturiano-sard).

source: primàriament, per a identificar unitats terminològiques (``fondos estructurales'', ``Real Decreto'', ``política monetaria''), col·locacions (``hacer frente'', ``tomar posiciones''), o noms d'entitat (``Nueva York'', ``Rodrigo Rato'', ``Unión Europea'') pròpies del text en qüestió.
es: Primariamente, para identificar unidades terminológicas (``fondos estructurales'', ``Real Decreto'', ``política monetaria''), colocaciones (``hacer frente'', ``tomar posicionas''), o nombres de entidad (``Nueva York'', ``Rodrigo Rato'', ``Unión Europea'') propias del texto en cuestión.

source: reduir a $[_Nn]$
es: reducir a $[_Nn]$

source: reduir a $[_O [_{SN} ] [_{SV} ] ]$
es: reducir a $[_O [_{SN} ] [_{SV} ] ]$

source: reduir a $[_{{N}} n adj ]$
es: reducir a $[_{{N}} n adj ]$

source: reduir a $[_{{N}} {n} ]$
es: reducir a $[_{{N}} {n} ]$

source: reduir a $[_{SN} det [_{{N}} {n} ] ]$
es: reducir a $[_{SN} det [_{{N}} {n} ] ]$

source: reduir a $[_{SN} det [_{{N}} ] ]$
es: reducir a $[_{SN} det [_{{N}} ] ]$

source: reduir a $[_{SN} [_{{N}} ] ]$
es: reducir a $[_{SN} [_{{N}} ] ]$

source: reduir a $[_{SN} [_{SN} ] [_{SP} ] ]$
es: reducir a $[_{SN} [_{SN} ] [_{SP} ] ]$

source: reduir a $[_{SN} det[_{{N}} ] ]$
es: reducir a $[_{SN} det[_{{N}} ] ]$

source: reduir a $[_{SP} prep [_{SN} ] ]$
es: reducir a $[_{SP} prep [_{SN} ] ]$

source: reduir a $[_{SV} v [_{SN} ] ] ]$
es: reducir a $[_{SV} v [_{SN} ] ] ]$

source: reduir a $[_{SV} v [_{SN} ] ]$
es: reducir a $[_{SV} v [_{SN} ] ]$

source: reduir a $[_{SV} v ]$
es: reducir a $[_{SV} v ]$

source: reduir a $[_{SV} [_{SV} ] [_{SP} ] ]$
es: reducir a $[_{SV} [_{SV} ] [_{SP} ] ]$

source: secundàriament, per a decidir automàticament, per a un mot que té diverses traduccions, quina és la traducció que ``sona més natural'' davant o darrere de la traducció d'una altra.
es: Secundariamente, para decidir automáticamente, para una palabra que tiene varias traducciones, cuál es la traducción que ``suena más natural'' delante o detrás de la traducción de otra.

source: {{10cm}{ Traducció directa és realment directa en els sistemes reals?
es: {{10cm}{ Traducción directa ¿es realmente directa en los sistemas reales?

source: {{4cm}{CONFLICTE: reduir a $[_{SP} prep [_{SN} ] ]$ o apilar-la}}
es: {{4cm}{CONFLICTO: reducir a $[_{SP} prep [_{SN} ] ]$ o apilarla}}

source: {{4cm}{CONFLICTE: reduir a $[_{SV} v [_{SN} ] ]$ o apilar-la}}
es: {{4cm}{CONFLICTE: reducir a $[_{SV} v [_{SN} ] ]$ o apilarla}}

source: {} es tracta d'un mot homòfon.
es: {} se trata de una palabra homófona.

source: {}el sistema es bloquejarà perquè només opera a nivell sintàctic {}l'ambigüitat lèxica no afecta el resultat perquè no afecta la sintaxi {}pot encara produirse un error en la traducció per causa de l'ambigüitat lèxica de transferència
es: {}El sistema se bloqueará porque sólo opera a nivel sintáctico {}la ambigüedad léxica no afecta el resultado porque no afecta la sintaxis {}puede todavía producirse un error en la traducción a causa de la ambigüedad léxica de transferencia

source: {}més complexa és la transferència.
es: {}más compleja es la transferencia.

source: {Anàlisi i generació morfològiques}
es: {Análisis y generación morfológica}

source: {Anàlisi sintàctica de la seqüència de categories lèxiques det n v det n $$ segons les accions especificades en la taula .}
es: {Análisis sintáctico de la secuencia de categorías léxicas det n v det n $$ según las acciones especificadas en la tabla .}

source: {Anàlisi sintàctica} L'anàlisi sintàctica pressuposa l'existència d'una gramàtica de la LO, és a dir, d'un conjunt de regles que descriuen com es construeixen, sintagma per sintagma, totes les frases vàlides de la LO: l'analitzador sintàctic actua després de l'analitzador morfològic, i obté l'arbre d'anàlisi sintàctica (o els arbres, si n'hi ha més d'un) a partir de la seqüència de categories lèxiques de la frase; cada arbre indica una possible combinació i ordre d'aplicació de regles que dóna lloc a la frase en qüestió. a partir d'altres sintagmes i de categories lèxiques.} Els algorismes d'anàlisi sintàctica poden ser { ascendents} (anglés bottom-up) quan construeixen l'arbre començant a partir de les fulles ---les categories lèxiques de cada mot--- anant cap a l'arrel ---el qual correspon al sintagma complet---, o descendents (anglés top-down), en cas contrari. Si la frase és estructuralment ambigua (vegeu l'apartat ), té més d'un arbre d'anàlisi sintàctica: alguns analitzadors produeixen tots els arbres possibles; d'altres, n'elegeixen un (usant alguna estratègia de desambiguació sintàctica com les descrites en ).
es: {Análisis sintáctico} El análisis sintáctico presupone la existencia de una gramática de la LO, es decir, de un conjunto de reglas que describen cómo se construyen, sintagma por sintagma, todas las frases válidas de la LO: el analizador sintáctico actúa después del analizador morfológico, y obtiene elárbol de análisis sintáctico (o los árboles, si no hay más de uno) a partir de la secuencia de categorías léxicas de la frase; cada árbol indica una posible combinación y orden de aplicación de reglas que da lugar a la frase en cuestión. a partir de otros sintagmas y de categorías léxicas.} Los algoritmos de análisis sintáctica pueden ser { ascendentes} (inglés bottom-up) cuando construyen el árbol comenzando a partir de las hojas ---las categorías léxicas de cada palabra--- yendo hacia la raíz ---el cual corresponde al sintagma completo---, o descendientes (inglés top-down), en caso contrario. Si la frase es estructuralmente ambigua (mirad el apartado ), tiene más de un árbol de análisis sintáctico: algunos analizadores producen todos los árboles posibles; otros, eligen uno (usando alguna estrategia de desambiguación sintáctica como las descritas en ).

source: {Arbre d'anàlisi sintàctica del sintagma ``The old professor's smart girlfriend's red car'' després d'haver-hi fet tots els reordenaments possibles amb les regles $R_1$ i $R_2$ (vegeu el text i les figures i ).} i es correspon amb l'arbre d'anàlisi sintàctica de la traducció, ``El cotxe roig de l'amiga intel·ligent del professor vell'', la qual es podria generar directament a partir de l'arbre.
es: {Árbol de análisis sintáctico del sintagma ``The old professor's smart girlfriend's red car'' después de haber hecho todos los reordenamientos posibles con las reglas $R_1$ i $R_2$ (mirad el texto y las figuras y ).} y se corresponde con el árbol de análisis sintáctico de la traducción, ```El coche rojo de la amiga inteligente del profesor viejo'', la cual se podría generar directamente a partir del árbol.
